torrents.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>torrents</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org8697645">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org3158783" class="outline-2">
<h2 id="org3158783">Torrents</h2>
<div class="outline-text-2" id="text-org3158783">
</div>
<div id="outline-container-org052dd0d" class="outline-3">
<h3 id="org052dd0d">torrent notes</h3>
<div class="outline-text-3" id="text-org052dd0d">
<ul class="org-ul">
<li>use magnet links that reference public tracker dht hashes</li>
<li>crawl dht or peer exchange for discovery</li>
<li>supports private torrents</li>
<li>invented by Bram Cohen</li>
<li>used for linux isos, game updates, etc</li>
<li>bencoded for .torrent file format</li>
<li>v2 standard
<ul class="org-ul">
<li>file hashes for cross swarm seeding are sha256 (32 bytes) instead of sha1 (20 bytes)</li>
<li><code>urn:btmh</code> is v2 magent uri
<ul class="org-ul">
<li><code>urn:btih</code> is v1</li>
</ul></li>
</ul></li>
<li>clients
<ul class="org-ul">
<li>transmission
<ul class="org-ul">
<li><a href="https://github.com/transmission/transmission/issues/2462">single threaded io</a></li>
<li>set env var <code>TR_CURL_SSL_NO_VERIFY=1</code> to disable invalid SSL cert checking</li>
</ul></li>
</ul></li>
<li>magent link can have ws for webseed
<ul class="org-ul">
<li>needs <code>xs</code> linked torrent or non <code>ws</code> peer for metadata</li>
</ul></li>
<li>min request size 16 KiB
<ul class="org-ul">
<li><a href="https://gitlab.com/boredcaveman/p2psearch">set page size to 16KiB when using sql.js-httpvfs</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7c78088" class="outline-3">
<h3 id="org7c78088">transmission notes</h3>
<div class="outline-text-3" id="text-org7c78088">
<ul class="org-ul">
<li><code>settings.json</code> set <code>"start-added-torrents": false,</code> to start torrents paused</li>
</ul>
</div>
</div>
<div id="outline-container-org251e544" class="outline-3">
<h3 id="org251e544">deluge notes</h3>
<div class="outline-text-3" id="text-org251e544">
<ul class="org-ul">
<li>webui is 8112 by default with pass of deluge</li>
<li>supports BEP55 for hole punching with utp(w/udp)</li>
<li>install config plugin <a href="https://github.com/ratanakvlun/deluge-ltconfig/releases">https://github.com/ratanakvlun/deluge-ltconfig/releases</a>
<ul class="org-ul">
<li>set performance default profile</li>
<li>set <code>"validate_https_trackers": false</code></li>
<li>set <code>"use_write_cache": false</code> for ssd</li>
<li>peer<sub>turnover</sub> to 0</li>
<li>max concurrent http announces to 15</li>
<li>coalesce reads/writes</li>
<li>checking mem usage to 2048</li>
<li>announce to all trackers</li>
<li>lower connections to 50 so NAT tables do not get overwhelmed</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
